/*
SQLyog Community v13.1.6 (64 bit)
MySQL - 8.0.30-txsql : Database - jusha-software-gantt-rostering
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`jusha-software-gantt-rostering` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `jusha-software-gantt-rostering`;

/*Table structure for table `employees` */

DROP TABLE IF EXISTS `employees`;

CREATE TABLE `employees` (
  `id` varchar(64) NOT NULL,
  `org_id` varchar(64) NOT NULL,
  `employee_id` varchar(64) NOT NULL,
  `user_id` varchar(64) DEFAULT NULL,
  `name` varchar(128) NOT NULL,
  `phone` varchar(32) DEFAULT NULL,
  `email` varchar(128) DEFAULT NULL,
  `department_id` varchar(64) DEFAULT NULL,
  `position` varchar(128) DEFAULT NULL,
  `role` varchar(64) DEFAULT NULL,
  `status` varchar(32) DEFAULT 'active',
  `hire_date` datetime(3) DEFAULT NULL,
  `created_at` datetime(3) DEFAULT NULL,
  `updated_at` datetime(3) DEFAULT NULL,
  `deleted_at` datetime(3) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_employees_employee_id` (`employee_id`),
  KEY `idx_employees_org_id` (`org_id`),
  KEY `idx_employees_user_id` (`user_id`),
  KEY `idx_employees_department_id` (`department_id`),
  KEY `idx_employees_deleted_at` (`deleted_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `employees` */

insert  into `employees`(`id`,`org_id`,`employee_id`,`user_id`,`name`,`phone`,`email`,`department_id`,`position`,`role`,`status`,`hire_date`,`created_at`,`updated_at`,`deleted_at`) values 
('010532f5-688f-4d21-804c-91b35e9dc6e7','default-org','062','','孙双双','','','1','','','active',NULL,'2025-11-06 14:45:37.976','2025-11-06 14:45:37.976',NULL),
('08a75281-0b60-4bdf-92d6-6463d1d61120','default-org','075','','陈钱','','','1','','','active',NULL,'2025-11-06 14:46:37.410','2025-11-06 14:46:37.410',NULL),
('0911e1e9-095f-424b-b387-11b595aa65d9','default-org','085','','雷艳','','','1','','','active',NULL,'2025-11-06 14:47:25.795','2025-11-06 14:47:25.795',NULL),
('0ac4522f-be27-4395-a118-38e6f1bb9745','default-org','036','','周飞','','','1','','','active',NULL,'2025-11-06 14:43:00.039','2025-11-06 14:43:00.039',NULL),
('0c02009a-bc33-41e9-8be8-1296dedcb3c0','default-org','142','','王晟宇','','','1','','','active',NULL,'2025-11-06 14:52:10.988','2025-11-06 14:52:10.988',NULL),
('0e30b5ba-33c3-4b9c-9126-7c86ddadde5e','default-org','140','','解远卓','','','1','','','active',NULL,'2025-11-06 14:52:02.933','2025-11-06 14:52:02.933',NULL),
('11f22c11-7b3b-4c41-8a22-1f14f22bd1ae','default-org','061','','程涵','','','1','','','active',NULL,'2025-11-06 14:45:33.446','2025-11-06 14:45:33.446',NULL),
('1459996f-08e3-42a3-8f2c-4e8d70833085','default-org','115','','郐祥元','','','1','','','active',NULL,'2025-11-06 14:49:50.960','2025-11-06 14:49:50.960',NULL),
('1763bf84-421e-4928-b5e8-e4f3cf62aaf9','default-org','074','','董卉妍','','','1','','','active',NULL,'2025-11-06 14:46:32.544','2025-11-06 14:46:32.544',NULL),
('1b887f9c-8f48-4686-81ea-dc66c56f4f29','default-org','045','','张艳秋','','','1','','','active',NULL,'2025-11-06 14:44:10.701','2025-11-06 14:44:10.701',NULL),
('1c21f4df-5e2b-4a53-900e-726dde03efe3','default-org','027','','严陈晨','','','1','','','active',NULL,'2025-11-06 14:40:50.972','2025-11-06 14:40:50.972',NULL),
('212f02a2-8b50-46d5-bc39-02ffb6a18140','default-org','050','','陆加明','','','1','','','active',NULL,'2025-11-06 14:44:38.732','2025-11-06 14:44:38.732',NULL),
('21fe9a5d-8a33-4ebd-b451-4e7327b15c30','default-org','060','','辛睿静','','','1','','','active',NULL,'2025-11-06 14:45:29.164','2025-11-06 14:45:29.164',NULL),
('26891585-3e15-40ec-b21c-88a9369a9e5a','default-org','097','','傅琳清','','','1','','','active',NULL,'2025-11-06 14:48:23.912','2025-11-06 14:48:23.912',NULL),
('27bf2d56-66c7-4669-a0cf-ed144eef4a58','default-org','021','','王正阁','','','1','','','active',NULL,'2025-11-06 14:40:21.697','2025-11-06 14:40:21.697',NULL),
('28ef5124-e57c-4ad4-8173-2c1efbd029fe','default-org','092','','王浩丞','','','1','','','active',NULL,'2025-11-06 14:47:59.569','2025-11-06 14:47:59.569',NULL),
('29202bd0-8ba3-4680-bb02-9e23d8ae511f','default-org','120','','刘钰','','','1','','','active',NULL,'2025-11-06 14:50:17.346','2025-11-06 14:50:17.346',NULL),
('2c4f62ff-6a5f-4b88-a8de-da5dc6288096','default-org','079','','尹佳妮','','','1','','','active',NULL,'2025-11-06 14:46:58.392','2025-11-06 14:46:58.392',NULL),
('2f14a9bd-f101-4362-9457-f252a19eeee2','default-org','146','','孔翔','','','1','','','active',NULL,'2025-11-06 14:52:31.031','2025-11-06 14:52:31.031',NULL),
('2fe01947-c733-4192-9e0e-396010371c8a','default-org','054','','王凤仙','','','1','','','active',NULL,'2025-11-06 14:45:00.206','2025-11-06 14:45:00.206',NULL),
('31274621-aef3-4977-9d1e-61b5a9736cc1','default-org','084','','胡杰','','','1','','','active',NULL,'2025-11-06 14:47:21.701','2025-11-06 14:47:21.701',NULL),
('33e10c96-f3c4-4358-9105-5be249167739','default-org','088','','刘舒寒','','','1','','','active',NULL,'2025-11-06 14:47:39.672','2025-11-06 14:47:39.672',NULL),
('3514386b-3e9d-4302-beba-013ca66c75aa','default-org','149','','路芳逸','','','1','','','active',NULL,'2025-11-06 14:52:46.351','2025-11-06 16:53:02.838',NULL),
('399a34d3-a753-4836-82b5-9516a4f7a21b','default-org','105','','郭惠宁','','','1','','','active',NULL,'2025-11-06 14:49:02.465','2025-11-06 14:49:02.465',NULL),
('3b43b7ef-b7a4-44f1-bac8-b40ff8dd79f2','default-org','053','','陈静','','','1','','','active',NULL,'2025-11-06 14:44:55.374','2025-11-06 14:44:55.374',NULL),
('3cbcd618-7d82-49a6-9aca-1d3c5db40de2','default-org','118','','陆彤','','','1','','','active',NULL,'2025-11-06 14:50:04.960','2025-11-06 14:50:04.960',NULL),
('3d891aab-17e2-4ecd-8cd5-1b4b77dbe977','default-org','137','','韦贝贝','','','1','','','active',NULL,'2025-11-06 14:51:49.997','2025-11-06 14:51:49.997',NULL),
('3e956831-4351-4557-bec0-031f6c5f3364','default-org','090','','孙开波','','','1','','','active',NULL,'2025-11-06 14:47:48.767','2025-11-06 14:47:48.767',NULL),
('3fc7d031-2955-4359-abed-2a7cbdfcc13d','default-org','109','','樊祥红','','','1','','','active',NULL,'2025-11-06 14:49:19.996','2025-11-06 14:49:19.996',NULL),
('42143147-8dd7-4b93-ba00-88636b54e38d','default-org','128','','徐超','','','1','','','active',NULL,'2025-11-06 14:51:11.927','2025-11-06 14:51:11.927',NULL),
('43aab6ac-be75-4270-a014-ea3eddf5780d','default-org','069','','施佳倩','','','1','','','active',NULL,'2025-11-06 14:46:08.092','2025-11-06 14:46:08.092',NULL),
('43ad3443-c016-446e-8a22-1da9ec062a86','default-org','134','','田慧花','','','1','','','active',NULL,'2025-11-06 14:51:36.935','2025-11-06 14:51:36.935',NULL),
('45d25180-f121-4616-b817-b06527989bca','default-org','048','','孟婕','','','1','','','active',NULL,'2025-11-06 14:44:28.644','2025-11-06 14:44:28.644',NULL),
('47783abe-15df-45e3-9dfc-34099139e6f9','default-org','147','','刘子强','','','1','','','active',NULL,'2025-11-06 14:52:36.497','2025-11-06 14:52:36.497',NULL),
('4876a61e-2e18-419f-9bf4-6e868180da13','default-org','123','','吴嫚玮','','','1','','','active',NULL,'2025-11-06 14:50:31.704','2025-11-06 14:50:31.704',NULL),
('4a22ea2c-35e6-477e-b4a1-c0e415000598','default-org','052','','李扬','','','1','','','active',NULL,'2025-11-06 14:44:49.323','2025-11-06 14:44:49.323',NULL),
('4ad60582-34ff-4af6-82f6-5af40cc46ec3','default-org','008','','辛小燕','','','1','','','active',NULL,'2025-11-06 14:36:58.975','2025-11-06 14:36:58.975',NULL),
('4c8306ad-aba3-470f-a3ab-492c816415f3','default-org','057','','冯倩倩','','','1','','','active',NULL,'2025-11-06 14:45:14.597','2025-11-06 14:45:14.597',NULL),
('4d0ee1ed-fabd-44d8-af3b-f1710da697b2','default-org','103','','孙晶爽','','','1','','','active',NULL,'2025-11-06 14:48:53.370','2025-11-06 14:48:53.370',NULL),
('4e748c63-bbdf-4ef0-af21-d2a9b1f1c1c0','default-org','122','','吴羽彤','','','1','','','active',NULL,'2025-11-06 14:50:27.797','2025-11-06 14:50:27.797',NULL),
('4fdb3b92-6291-4eef-b33b-0a10fe9caee9','default-org','089','','徐晶','','','1','','','active',NULL,'2025-11-06 14:47:43.677','2025-11-06 14:47:43.677',NULL),
('50a6ed32-395d-45dc-9a2e-05961e48c069','default-org','038','','张海龙','','','1','','','active',NULL,'2025-11-06 14:43:15.019','2025-11-06 14:43:15.019',NULL),
('5206f1b6-22d6-4db2-83c0-c2fa6b954e08','default-org','006','','顾康康','','','1','','','active',NULL,'2025-11-06 14:36:42.134','2025-11-06 14:36:42.134',NULL),
('5322ca36-6d31-48d3-921b-1a33b9a3f8c0','default-org','096','','龙聪','','','1','','','active',NULL,'2025-11-06 14:48:18.317','2025-11-06 14:48:18.317',NULL),
('538d3da3-a126-4e92-9a03-516060452155','default-org','020','','陈伯柱','','','1','','','active',NULL,'2025-11-06 14:40:15.148','2025-11-06 14:40:15.148',NULL),
('546101c7-cda2-434e-8555-dc788a9820ff','default-org','049','','郑欢欢','','','1','','','active',NULL,'2025-11-06 14:44:34.260','2025-11-06 14:44:34.260',NULL),
('572c7c54-07d3-4fc6-8e4c-e21d2fb502e1','default-org','121','','姜星芝','','','1','','','active',NULL,'2025-11-06 14:50:23.254','2025-11-06 14:50:23.254',NULL),
('5918747b-cfa6-47bc-a8ae-2758d1927fad','default-org','015','','李冠','','','1','','','active',NULL,'2025-11-06 14:37:43.560','2025-11-06 14:37:43.560',NULL),
('592b5c71-2b00-4400-9e6b-88a54c0f6a62','default-org','136','','高娟娟','','','1','','','active',NULL,'2025-11-06 14:51:45.674','2025-11-06 14:51:45.674',NULL),
('5c5f13ab-2f90-47ff-b801-43325cfcba49','default-org','129','','孙梓婷','','','1','','','active',NULL,'2025-11-06 14:51:15.559','2025-11-06 14:51:15.559',NULL),
('5c671b46-a14c-4bcb-969e-a82e151c5053','default-org','086','','李姝影','','','1','','','active',NULL,'2025-11-06 14:47:29.754','2025-11-06 14:47:29.754',NULL),
('5df8a8cb-8550-47d2-b2d1-fcb6275b1b2a','default-org','145','','苏彤','','','1','','','active',NULL,'2025-11-06 14:52:26.395','2025-11-06 14:52:26.395',NULL),
('5e57ef40-97f1-484a-8254-e9948431db62','default-org','028','','梁静','','','1','','','active',NULL,'2025-11-06 14:40:56.053','2025-11-06 14:40:56.053',NULL),
('5e68bcf6-fd9a-405f-ae61-4392c6be5387','default-org','018','','李丹燕','','','1','','','active',NULL,'2025-11-06 14:38:15.892','2025-11-06 14:38:15.892',NULL),
('5fb2603a-9904-4171-8b06-982df153a69c','default-org','080','','王成','','','1','','','active',NULL,'2025-11-06 14:47:03.642','2025-11-06 14:47:03.642',NULL),
('6290cf98-e61d-4db0-84d3-f22ee7b13b89','default-org','144','','贺典','','','1','','','active',NULL,'2025-11-06 14:52:19.422','2025-11-06 14:52:19.422',NULL),
('664c0b28-b15d-4f07-8db6-e45deaf2cf59','default-org','013','','常莹','','','1','','','active',NULL,'2025-11-06 14:37:29.977','2025-11-06 14:37:29.977',NULL),
('6960e06a-86e8-468f-9fc6-a4f783422676','default-org','102','','张茂霖','','','1','','','active',NULL,'2025-11-06 14:48:49.202','2025-11-06 14:48:49.202',NULL),
('6a972e61-9189-4158-8059-bb71c0d4fa36','default-org','124','','张聪','','','1','','','active',NULL,'2025-11-06 14:50:36.009','2025-11-06 14:50:36.009',NULL),
('6aae120f-4f5f-4506-afb6-c2d4f59b4df0','default-org','032','','项蕾','','','1','','','active',NULL,'2025-11-06 14:41:15.921','2025-11-06 14:41:15.921',NULL),
('6e8b1693-704f-410b-82a7-55d4e0f0dd99','default-org','016','','戚荣丰','','','1','','','active',NULL,'2025-11-06 14:37:59.568','2025-11-06 14:37:59.568',NULL),
('700b386d-de9b-4085-9db5-ea618a9c23dd','default-org','138','','李如画','','','1','','','active',NULL,'2025-11-06 14:51:53.869','2025-11-06 14:51:53.869',NULL),
('71687b13-a03a-4849-b2de-24bf98af5b67','default-org','101','','乔婷婷','','','1','','','active',NULL,'2025-11-06 14:48:45.072','2025-11-06 14:48:45.072',NULL),
('73a5fc2e-24f8-40c7-b34e-473ac0149a80','default-org','056','','王军霞','','','1','','','active',NULL,'2025-11-06 14:45:10.026','2025-11-06 14:45:10.026',NULL),
('7561e9df-5e88-442a-8ec1-a75673fe2993','default-org','098','','朱雅静','','','1','','','active',NULL,'2025-11-06 14:48:28.649','2025-11-06 14:48:28.649',NULL),
('794476b9-083e-423e-ab86-a3bcf86a4785','default-org','030','','马义','','','1','','','active',NULL,'2025-11-06 14:41:05.769','2025-11-06 14:41:05.769',NULL),
('7964872a-37ad-43a6-ae77-043faf979664','default-org','112','','翟学','','','1','','','active',NULL,'2025-11-06 14:49:33.328','2025-11-06 14:49:33.328',NULL),
('7abdfcf9-88da-4b3a-b452-13a9c612daaa','default-org','070','','刘高平','','','1','','','active',NULL,'2025-11-06 14:46:13.042','2025-11-06 14:46:13.042',NULL),
('7ce3ccda-f074-419b-9bf1-2b9fd3958e8a','default-org','133','','令潇','','','1','','','active',NULL,'2025-11-06 14:51:33.381','2025-11-06 14:51:33.381',NULL),
('7cf1dc16-2693-4656-877a-b66329f3482c','default-org','009','','杨献峰','','','1','','','active',NULL,'2025-11-06 14:37:05.865','2025-11-06 14:37:05.865',NULL),
('7d0529ff-d61e-49d3-bf54-4957921fbc22','default-org','135','','吴德尚','','','1','','','active',NULL,'2025-11-06 14:51:41.258','2025-11-06 14:51:41.258',NULL),
('7f47a28d-2293-459e-b49f-98afe56f72e6','default-org','087','','刘丹','','','1','','','active',NULL,'2025-11-06 14:47:35.346','2025-11-06 14:47:35.346',NULL),
('7ff7c03d-3da2-4046-9618-3df672ab1bed','default-org','130','','杨硕','','','1','','','active',NULL,'2025-11-06 14:51:20.012','2025-11-06 14:51:20.012',NULL),
('81c0b529-eeb5-477f-8296-ef302af9d77c','default-org','059','','胡俊','','','1','','','active',NULL,'2025-11-06 14:45:23.958','2025-11-06 14:45:23.958',NULL),
('84f6130e-2114-4b69-ba41-e8396e38cd43','default-org','031','','梁雪','','','1','','','active',NULL,'2025-11-06 14:41:10.048','2025-11-06 14:41:10.048',NULL),
('8599dab1-66d1-46be-83f0-6c75ac18a166','default-org','004','','秦国初','','','1','','','active',NULL,'2025-11-06 13:43:34.018','2025-11-06 13:43:34.018',NULL),
('85a2df6d-9de1-4428-8164-7ed95bfb1fd9','default-org','148','','张昭奉','','','1','','','active',NULL,'2025-11-06 14:52:41.886','2025-11-06 16:23:53.950',NULL),
('8720fab0-5568-4fba-87b5-e83a2bb40df0','default-org','019','','李辉','','','1','','','active',NULL,'2025-11-06 14:40:10.113','2025-11-06 14:40:10.113',NULL),
('8859162c-65db-439d-818e-ca7e27e91dfe','default-org','063','','彭昕','','','1','','','active',NULL,'2025-11-06 14:45:42.046','2025-11-06 14:45:42.046',NULL),
('8ae74911-4452-49d6-8717-175e7bb35577','default-org','026','','佟琪','','','1','','','active',NULL,'2025-11-06 14:40:47.224','2025-11-06 14:40:47.224',NULL),
('8b3d4791-7deb-4432-b916-7fe7973b16ef','default-org','131','','李冬梅','','','1','','','active',NULL,'2025-11-06 14:51:25.160','2025-11-06 14:51:25.160',NULL),
('8ccda435-15aa-4e82-a828-6e296a4aa305','default-org','139','','黄桐宇','','','1','','','active',NULL,'2025-11-06 14:51:57.803','2025-11-06 14:51:57.803',NULL),
('8de9b7ba-a942-40a7-a877-f51bb5f51459','default-org','095','','梁欢欢','','','1','','','active',NULL,'2025-11-06 14:48:11.865','2025-11-06 14:48:11.865',NULL),
('8debce96-db21-4218-9f99-fd524caac9b9','default-org','117','','李旭晓','','','1','','','active',NULL,'2025-11-06 14:50:00.125','2025-11-06 14:50:00.125',NULL),
('8df441b1-e359-486c-8334-1556807aa82d','default-org','082','','陈夫涛','','','1','','','active',NULL,'2025-11-06 14:47:12.540','2025-11-06 14:47:12.540',NULL),
('8e5c97bf-206c-4d12-b75a-2030bd2bb697','default-org','064','','何雪颖','','','1','','','active',NULL,'2025-11-06 14:45:46.743','2025-11-06 14:45:46.743',NULL),
('8f340693-01df-410d-9320-24aedec8049a','default-org','073','','胡清','','','1','','','active',NULL,'2025-11-06 14:46:28.043','2025-11-06 14:46:28.043',NULL),
('8f38854b-d271-4307-9d7c-ed1c2db4567f','default-org','055','','储晨','','','1','','','active',NULL,'2025-11-06 14:45:05.798','2025-11-06 14:45:05.798',NULL),
('983c6b82-95d2-4b17-bb49-382a77291747','default-org','022','','余鸿鸣','','','1','','','active',NULL,'2025-11-06 14:40:27.574','2025-11-06 14:40:27.574',NULL),
('9b0bbcbe-8fa6-4589-bad0-b0f1be75e2e4','default-org','025','','魏晓磊','','','1','','','active',NULL,'2025-11-06 14:40:42.176','2025-11-06 14:40:42.176',NULL),
('9d043735-f0f1-40a0-81c1-a85be6eae01d','default-org','100','','宋雅琪','','','1','','','active',NULL,'2025-11-06 14:48:40.385','2025-11-06 14:48:40.385',NULL),
('9d192e0a-93b2-451d-ad47-e4ea32cc4cca','default-org','068','','杨惠泉','','','1','','','active',NULL,'2025-11-06 14:46:03.274','2025-11-06 14:46:03.274',NULL),
('9e3b1115-3078-4f80-9b90-599bdc4fd798','default-org','083','','陈玉灿','','','1','','','active',NULL,'2025-11-06 14:47:16.873','2025-11-06 14:47:16.873',NULL),
('9e9bb8dd-f587-4ecb-afba-28f47fff69ef','default-org','039','','叶梅萍','','','1','','','active',NULL,'2025-11-06 14:43:20.900','2025-11-06 14:43:20.900',NULL),
('a262b6b2-6a7a-4b75-957c-42e61a6f45b9','default-org','003','','周正扬','','','1','','','active',NULL,'2025-11-06 13:43:23.412','2025-11-06 13:43:23.412',NULL),
('a334bcf3-f34c-4ab3-b161-9b9ccdd7f2f9','default-org','066','','薛秋苍','','','1','','','active',NULL,'2025-11-06 14:45:55.314','2025-11-06 14:45:55.314',NULL),
('a614e672-bee4-48d7-b7b9-fee136b4a78c','default-org','014','','唐敏','','','1','','','active',NULL,'2025-11-06 14:37:35.707','2025-11-06 14:37:35.707',NULL),
('a639ee57-5b6c-4c29-ae68-e5e8a2ab095a','default-org','047','','季长风','','','1','','','active',NULL,'2025-11-06 14:44:24.510','2025-11-06 14:44:24.510',NULL),
('a6f929a5-a4f9-4807-9c62-3ee036746743','default-org','007','','麦筱莉','','','1','','','active',NULL,'2025-11-06 14:36:49.039','2025-11-06 14:36:49.039',NULL),
('a9497e77-9709-4fc4-b942-c3809a4da87e','default-org','111','','梅金婷','','','1','','','active',NULL,'2025-11-06 14:49:29.084','2025-11-06 14:49:29.084',NULL),
('a9c1c578-f82c-41bd-b902-448bac11e3e1','default-org','010','','张鑫','','','1','','','active',NULL,'2025-11-06 14:37:12.352','2025-11-06 14:37:12.352',NULL),
('ac715ceb-7e4f-44d3-b0a5-48e87992728a','default-org','058','','尹克杰','','','1','','','active',NULL,'2025-11-06 14:45:19.719','2025-11-06 14:45:19.719',NULL),
('ad76924c-ea3a-4905-b0ef-5bbbbc62ee80','default-org','017','','施婷婷','','','1','','','active',NULL,'2025-11-06 14:38:08.798','2025-11-06 14:38:08.798',NULL),
('adcb5b71-1e55-4df3-bd2c-5f29b1482657','default-org','106','','乔娜娜','','','1','','','active',NULL,'2025-11-06 14:49:06.567','2025-11-06 14:49:06.567',NULL),
('aea36cec-80f0-42e9-85f7-2d66d99c8c7e','default-org','093','','张易','','','1','','','active',NULL,'2025-11-06 14:48:03.238','2025-11-06 14:48:03.238',NULL),
('b1892387-58e0-4ad8-950f-b78649229b3c','default-org','076','','张雯','','','1','','','active',NULL,'2025-11-06 14:46:42.162','2025-11-06 14:46:42.162',NULL),
('b2d9f34b-1481-4bc8-991b-d8e87af7e544','default-org','125','','宫雯莉','','','1','','','active',NULL,'2025-11-06 14:50:58.658','2025-11-06 14:50:58.658',NULL),
('b5506905-eee6-43df-a073-783ac1319881','default-org','033','','王欢欢','','','1','','','active',NULL,'2025-11-06 14:41:20.925','2025-11-06 14:41:20.925',NULL),
('b625ba9b-a2f7-44af-9e4d-a2b2d29850db','default-org','072','','王晨','','','1','','','active',NULL,'2025-11-06 14:46:23.323','2025-11-06 14:46:23.323',NULL),
('b7711633-784c-495f-b315-35409458a689','default-org','035','','周晋','','','1','','','active',NULL,'2025-11-06 14:41:31.470','2025-11-06 14:41:31.470',NULL),
('b7bf4789-e11d-4a5a-8f87-69afe7323f6f','default-org','043','','祝丽','','','1','','','active',NULL,'2025-11-06 14:44:01.210','2025-11-06 14:44:01.210',NULL),
('b85174fe-8d84-406d-8b42-73bba135fa5d','default-org','108','','徐嘉佳','','','1','','','active',NULL,'2025-11-06 14:49:15.286','2025-11-06 14:49:15.286',NULL),
('b86c32b9-91e4-44de-a1b3-6dc80a87a486','default-org','078','','顾燕','','','1','','','active',NULL,'2025-11-06 14:46:53.898','2025-11-06 14:46:53.898',NULL),
('ba17a21a-546d-4871-925d-aae9205869c9','default-org','116','','叶粟','','','1','','','active',NULL,'2025-11-06 14:49:55.458','2025-11-06 14:49:55.458',NULL),
('ba5a1569-f527-461b-b7d2-5992251b871e','default-org','141','','丁月健','','','1','','','active',NULL,'2025-11-06 14:52:07.075','2025-11-06 14:52:07.075',NULL),
('bbee1eaa-62d8-4db7-a635-2e18b5931a0c','default-org','037','','李卫萍','','','1','','','active',NULL,'2025-11-06 14:43:09.594','2025-11-06 14:43:09.594',NULL),
('c002f57b-e041-464c-8f29-f04597e8f124','default-org','012','','窦鑫','','','1','','','active',NULL,'2025-11-06 14:37:24.462','2025-11-06 14:37:24.462',NULL),
('c07d6ee9-5b9a-42b6-a525-9f9dad59fd08','default-org','002','','李宝新','','','1','','','active',NULL,'2025-11-06 13:43:17.979','2025-11-06 13:43:17.979',NULL),
('c27de258-0f50-44a8-85f5-f4cc0a408142','default-org','046','','周楠','','','1','','','active',NULL,'2025-11-06 14:44:15.593','2025-11-06 14:44:15.593',NULL),
('c2dd702b-fc75-4ce1-bde0-8b7fa5b40848','default-org','126','','季耀','','','1','','','active',NULL,'2025-11-06 14:51:03.757','2025-11-06 14:51:03.757',NULL),
('c74caf40-d0ce-4fad-b72e-ef24aad5d3b8','default-org','107','','马林','','','1','','','active',NULL,'2025-11-06 14:49:10.452','2025-11-06 14:49:10.452',NULL),
('c7d0c2c8-3ac2-41d9-91c3-be3c12b811a1','default-org','113','','章志伟','','','1','','','active',NULL,'2025-11-06 14:49:37.659','2025-11-06 14:49:37.659',NULL),
('c8c90a41-ab52-4e2b-97cd-04f97cead6dd','default-org','081','','李欣','','','1','','','active',NULL,'2025-11-06 14:47:08.478','2025-11-06 14:47:08.478',NULL),
('d2b4873a-e907-45b0-b107-9b845727a713','default-org','040','','陈思璇','','','1','','','active',NULL,'2025-11-06 14:43:29.060','2025-11-06 14:43:29.060',NULL),
('d4e28505-4aa0-457e-8817-ae166d367de4','default-org','005','','张莉','','','1','','','active',NULL,'2025-11-06 14:36:33.605','2025-11-06 14:36:33.605',NULL),
('d70aa76e-75da-40ad-b23a-585c45a6223c','default-org','071','','祁宇','','','1','','','active',NULL,'2025-11-06 14:46:18.657','2025-11-06 14:46:18.657',NULL),
('dc046678-fc1f-4307-a432-4157ee0852fc','default-org','051','','施桦','','','1','','','active',NULL,'2025-11-06 14:44:43.696','2025-11-06 14:44:43.696',NULL),
('dd9efcea-4abe-4079-b349-0cbb5f934643','default-org','034','','武文博','','','1','','','active',NULL,'2025-11-06 14:41:25.717','2025-11-06 14:41:25.717',NULL),
('de40160c-bc88-4897-9e5a-1ada53a6639d','default-org','094','','徐梦颖','','','1','','','active',NULL,'2025-11-06 14:48:07.023','2025-11-06 14:48:07.023',NULL),
('e0ab0721-ae2a-4138-95f3-b9ffb9d056ac','default-org','114','','杨飞','','','1','','','active',NULL,'2025-11-06 14:49:42.744','2025-11-06 14:49:42.744',NULL),
('e411b696-a34a-40b9-8381-6567f55f497b','default-org','044','','刘宇','','','1','','','active',NULL,'2025-11-06 14:44:05.800','2025-11-06 14:44:05.800',NULL),
('e438f171-baac-4033-9e4a-47d865536d2a','default-org','001','','朱斌','','','1','','','active',NULL,'2025-11-06 13:43:09.066','2025-11-06 13:43:09.066',NULL),
('e4fd4774-fa3c-49dd-8842-2f71cffa6c61','default-org','029','','陈文萍','','','1','','','active',NULL,'2025-11-06 14:41:01.243','2025-11-06 14:41:01.243',NULL),
('ea36ab46-0c39-4e34-8e5a-cf184939802c','default-org','110','','张舒','','','1','','','active',NULL,'2025-11-06 14:49:24.682','2025-11-06 14:49:24.682',NULL),
('eabb3e52-b3ad-49b4-a579-7599c54bef57','default-org','023','','倪玲','','','1','','','active',NULL,'2025-11-06 14:40:31.978','2025-11-06 14:40:31.978',NULL),
('eaf32e34-4223-4c68-9ddb-ebc173ddc28d','default-org','091','','范沈豫','','','1','','','active',NULL,'2025-11-06 14:47:55.379','2025-11-06 14:47:55.379',NULL),
('eaf9932d-bd31-43bc-9ef3-37af0fa3d8f9','default-org','104','','邓启明','','','1','','','active',NULL,'2025-11-06 14:48:57.725','2025-11-06 14:48:57.725',NULL),
('eebeb4cd-a23f-401b-bd42-baac730fbfc6','default-org','067','','王茂雪','','','1','','','active',NULL,'2025-11-06 14:45:59.350','2025-11-06 14:45:59.350',NULL),
('ef18fa7f-dc55-4d2c-9b3f-35b674ad236c','default-org','041','','周群','','','1','','','active',NULL,'2025-11-06 14:43:41.412','2025-11-06 14:43:41.412',NULL),
('ef9ce626-43bf-4da4-accf-c4f94d902801','default-org','042','','杨雯','','','1','','','active',NULL,'2025-11-06 14:43:56.796','2025-11-06 14:43:56.796',NULL),
('f0d3c7d3-f494-4161-9722-80abd26689fb','default-org','065','','丁升','','','1','','','active',NULL,'2025-11-06 14:45:51.257','2025-11-06 14:45:51.257',NULL),
('f0f80cba-4364-4af9-ba41-0978a7112eb2','default-org','099','','张雪','','','1','','','active',NULL,'2025-11-06 14:48:35.334','2025-11-06 14:48:35.334',NULL),
('f10df04b-b6dd-4261-a5e3-d15658a7956e','default-org','077','','程乐','','','1','','','active',NULL,'2025-11-06 14:46:47.957','2025-11-06 14:46:47.957',NULL),
('f52003e1-f12d-425e-b670-ce605f271bca','default-org','127','','宋扬','','','1','','','active',NULL,'2025-11-06 14:51:07.839','2025-11-06 14:51:07.839',NULL),
('f5e03ef7-bf23-40c5-8fc7-8a765476f486','default-org','132','','袁芳','','','1','','','active',NULL,'2025-11-06 14:51:29.188','2025-11-06 14:51:29.188',NULL),
('f5f381f3-5963-421e-85df-c4e2ba2e6c93','default-org','143','','姜玥','','','1','','','active',NULL,'2025-11-06 14:52:14.647','2025-11-06 14:52:14.647',NULL),
('f6e96ea8-64cd-4452-80fc-7a9bebae7db8','default-org','024','','刘松','','','1','','','active',NULL,'2025-11-06 14:40:37.293','2025-11-06 14:40:37.293',NULL),
('fa55bb2a-58e2-4acf-805b-9be531acabe9','default-org','011','','孙晓敏','','','1','','','active',NULL,'2025-11-06 14:37:19.208','2025-11-06 14:37:19.208',NULL),
('fcb3fee9-fcb3-460c-92d2-eef681d8fa8d','default-org','119','','王子晗','','','1','','','active',NULL,'2025-11-06 14:50:10.803','2025-11-06 14:50:10.803',NULL);

/*Table structure for table `groups` */

DROP TABLE IF EXISTS `groups`;

CREATE TABLE `groups` (
  `id` varchar(64) NOT NULL,
  `org_id` varchar(64) NOT NULL,
  `name` varchar(128) NOT NULL,
  `code` varchar(64) NOT NULL,
  `type` varchar(32) DEFAULT NULL,
  `description` text,
  `parent_id` varchar(64) DEFAULT NULL,
  `leader_id` varchar(64) DEFAULT NULL,
  `attributes` text,
  `status` varchar(32) DEFAULT 'active',
  `created_at` datetime(3) DEFAULT NULL,
  `updated_at` datetime(3) DEFAULT NULL,
  `deleted_at` datetime(3) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_org_code` (`code`),
  KEY `idx_groups_org_id` (`org_id`),
  KEY `idx_groups_parent_id` (`parent_id`),
  KEY `idx_groups_deleted_at` (`deleted_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `groups` */

insert  into `groups`(`id`,`org_id`,`name`,`code`,`type`,`description`,`parent_id`,`leader_id`,`attributes`,`status`,`created_at`,`updated_at`,`deleted_at`) values 
('05a3bea2-2b9f-4ed4-84de-4e5b556cbe5f','default-org','DR审核组','104','team','','',NULL,'','active','2025-11-06 20:08:00.814','2025-11-06 20:08:00.814',NULL),
('2a009e64-7eab-4f32-bd81-5ef96d6551bc','default-org','审核/报告组','103','team','','',NULL,'','active','2025-11-06 15:19:19.437','2025-11-06 15:19:19.437',NULL),
('4910c762-2f39-483e-9aaf-e7204d330331','default-org','急诊审核','209','team','','',NULL,'','active','2025-12-16 10:33:52.192','2025-12-16 10:41:41.320',NULL),
('58464a49-80e8-438d-8e5d-8623523ece60','default-org','CT/MRI轮转1','202','team','','',NULL,'','active','2025-11-08 09:10:51.420','2025-11-08 09:10:51.420',NULL),
('59c228ea-102a-4ade-aa2c-f64ba7b60a57','default-org','江北夜班','303','team','','',NULL,'','active','2025-11-07 09:30:20.785','2025-11-07 09:30:20.785',NULL),
('86a00075-25e3-4afb-b509-81ecf228d20f','default-org','科研班','301','team','','',NULL,'','active','2025-11-08 09:19:54.755','2025-11-08 09:19:54.755',NULL),
('9c2e3ab0-fa81-4266-aa75-4a694ea268b8','default-org','CT/MRI轮转2','203','team','','',NULL,'','active','2025-11-08 09:18:21.395','2025-11-08 09:18:21.395',NULL),
('a1727d63-7cbe-4287-9430-acc218e50118','default-org','非固定审核组','102','team','','',NULL,'','active','2025-11-06 15:18:17.673','2025-11-06 15:18:17.673',NULL),
('add1015e-5f24-4773-9ae3-ccf5d42ee749','default-org','职工报告组','204','team','','',NULL,'','active','2025-11-06 15:20:01.705','2025-12-16 10:18:12.497',NULL),
('b2528c69-fa24-44ee-9808-dafa0a88edb4','default-org','江北穿刺','205','team','','',NULL,'','active','2025-11-08 09:02:41.755','2025-12-16 11:06:03.825',NULL),
('c4837ec9-bfbd-4be6-8d90-dff214d80d0f','default-org','本部夜班','302','team','','',NULL,'','active','2025-11-08 09:05:57.571','2025-11-08 09:05:57.571',NULL),
('c48954ba-dd28-4e5b-935b-8438c145932d','default-org','光子冠脉CTA','206','team','','',NULL,'','active','2025-11-08 09:00:55.153','2025-12-31 11:48:30.573',NULL),
('d0b0ecff-ed63-4842-887a-153d80fac274','default-org','DR学员轮转组','201','team','定期轮转','',NULL,'','active','2025-11-06 20:03:55.544','2025-11-06 20:05:31.265',NULL),
('d43f00bf-7ad0-4b77-9b94-ce5c9ade2f22','default-org','急诊审核','105','team','','',NULL,'','active','2025-11-08 09:24:50.225','2025-11-08 09:24:50.225',NULL),
('e0f7950e-f3e6-42e3-b867-f4857d2e7c27','default-org','新入职','207','team','','',NULL,'','active','2025-11-08 09:08:38.020','2025-11-08 09:08:38.020',NULL),
('e17cebec-6e6a-4478-af8f-bd6df8444a77','default-org','本部穿刺','210','team','','',NULL,'','active','2025-12-16 11:07:13.973','2025-12-16 11:07:13.973',NULL),
('fcd069bf-9667-43b8-ab99-c424fc339c63','default-org','固定审核组','101','team','','',NULL,'','active','2025-11-06 15:17:11.373','2025-11-06 15:17:11.373',NULL);

/*Table structure for table `shifts` */

DROP TABLE IF EXISTS `shifts`;

CREATE TABLE `shifts` (
  `id` varchar(64) NOT NULL,
  `org_id` varchar(64) NOT NULL,
  `name` varchar(128) NOT NULL,
  `code` varchar(64) NOT NULL,
  `type` varchar(32) DEFAULT NULL,
  `description` text,
  `start_time` varchar(8) NOT NULL,
  `end_time` varchar(8) NOT NULL,
  `duration` bigint DEFAULT NULL,
  `is_overnight` tinyint(1) DEFAULT NULL,
  `color` varchar(32) DEFAULT NULL,
  `priority` bigint DEFAULT '0',
  `default_staff_count` bigint DEFAULT '1',
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` datetime(3) DEFAULT NULL,
  `updated_at` datetime(3) DEFAULT NULL,
  `deleted_at` datetime(3) DEFAULT NULL,
  `scheduling_priority` bigint DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_org_code` (`code`),
  KEY `idx_shifts_org_id` (`org_id`),
  KEY `idx_shifts_deleted_at` (`deleted_at`),
  KEY `idx_shifts_scheduling_priority` (`org_id`,`scheduling_priority`,`is_active`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `shifts` */

insert  into `shifts`(`id`,`org_id`,`name`,`code`,`type`,`description`,`start_time`,`end_time`,`duration`,`is_overnight`,`color`,`priority`,`default_staff_count`,`is_active`,`created_at`,`updated_at`,`deleted_at`,`scheduling_priority`) values 
('07912c61-f2d7-4e2b-a92e-2856c5ca859c','default-org','CT/MRI审核上','201','regular','CT/MRI审核报告-上午班次','08:00','14:00',360,0,'#67C23A',0,17,1,'2025-11-06 15:14:26.186','2026-03-13 11:34:40.176',NULL,113),
('1eee1f6b-2439-4823-9ec0-d9c0f7c522fd','default-org','DR报告下','106','regular','DR写报告-下午班次','13:30','17:30',240,0,'#409EFF',0,1,0,'2025-11-06 15:09:58.640','2025-11-08 10:27:59.942',NULL,12),
('217364fc-2b99-4aa7-9f5e-a1bc3e13657a','default-org','CT/MRI审核下','202','regular','CT/MRI审核报告-下午班次','14:00','20:00',360,0,'#409EFF',0,17,1,'2025-11-06 15:14:49.930','2026-03-13 14:13:35.553',NULL,114),
('22223215-37cc-4a2b-aa31-705b1e5018d0','default-org','下夜班','307','regular','周一至周日','00:00','08:00',480,0,'#AA7E9A',0,2,1,'2025-11-08 10:12:03.778','2026-03-13 15:05:46.252',NULL,4),
('256c06f9-235c-4d78-91f9-9228cc107c19','default-org','科研','304','regular','周一至周五','08:00','18:00',600,0,'#20B2AA',0,1,0,'2025-11-08 10:06:20.707','2025-12-24 16:28:58.430',NULL,104),
('25afbbf1-0077-4ccb-a788-d311a8f99bc0','default-org','江北夜班','306','regular','周一至周日','20:00','24:00',240,0,'#E6A23C',0,1,1,'2025-11-08 10:10:36.950','2026-03-13 17:22:48.424',NULL,3),
('3313cf99-b4f7-4116-8634-5e9a46a81e41','default-org','急诊审核下','402','regular','','14:00','20:00',360,0,'#FB688D',0,1,1,'2025-12-31 10:47:53.714','2026-03-13 11:34:28.942',NULL,8),
('35897995-a027-48c4-86f5-7411b99f836e','default-org','江北穿刺','302','regular','不显示在排班表上','14:00','20:00',360,0,'#909399',0,1,1,'2025-11-08 10:02:23.530','2026-03-13 15:09:26.648',NULL,1),
('4d4a1edb-15e6-4079-80b2-eb5fa59926e3','default-org','本部穿刺','301','regular','本部穿刺当天与其它班次互斥','08:00','20:00',720,0,'#C71585',0,1,1,'2025-11-08 10:00:42.194','2025-12-31 11:32:20.831',NULL,5),
('5573cfa4-417d-432e-9c6f-77d2979ab689','default-org','DR审核上','203','regular','DR审核报告-上午班次','08:00','12:00',240,0,'#67C23A',0,10,0,'2025-11-06 15:15:44.739','2025-11-21 14:38:55.142',NULL,111),
('5fb734b0-4929-4ff3-8f2b-9edbfc438954','default-org','CT/MRI报告下','108','regular','CT+MRI合班写报告-下午班次','14:00','20:00',360,0,'#409EFF',0,9,1,'2025-11-06 15:11:34.433','2026-03-13 15:10:54.928',NULL,116),
('6147eb2d-d575-414a-9630-97fe5aca401b','default-org','CT报告上','101','regular','CT写报告-上午班次','08:00','14:00',360,0,'#67C23A',0,1,0,'2025-11-06 14:56:52.615','2025-12-24 16:28:54.307',NULL,13),
('6b4cd747-dce1-4c57-a5c0-04db2c3c45b6','default-org','光子冠脉CTA','303','regular','周一至周五，一天一个','14:00','20:00',360,0,'#FF69B4',0,1,1,'2025-11-08 10:04:11.792','2026-03-13 17:27:13.514',NULL,2),
('74a0c63a-a45d-42fc-984f-80ee31311452','default-org','MRI报告下','104','regular','MRI写报告-下午班次','14:00','20:00',360,0,'#409EFF',0,4,0,'2025-11-06 15:07:03.521','2025-12-24 16:28:56.224',NULL,16),
('78e39561-0f57-4e25-8312-a3ca6ce12eda','default-org','DR报告上','105','regular','DR写报告-上午班次','08:00','12:00',240,0,'#67C23A',0,1,0,'2025-11-06 15:09:19.106','2025-11-08 10:27:58.032',NULL,11),
('78f7e5e2-8e5f-4f04-b38f-e21e5ac57e27','default-org','MRI报告上','103','regular','MRI写报告-上午班次','08:00','14:00',360,0,'#67C23A',0,5,0,'2025-11-06 15:02:09.123','2025-12-26 13:42:29.026',NULL,15),
('ab846727-01c6-4190-bef7-0d218b7dfeaa','default-org','CT报告下','102','regular','CT写报告-下午班次','14:00','20:00',360,0,'#409EFF',0,1,0,'2025-11-06 15:00:55.975','2025-12-24 16:28:55.065',NULL,14),
('c803c325-dc3c-4738-b5f2-bb030089b7e2','default-org','CT/MRI报告上','107','regular','CT+MRI合班写报告-上午班次','08:00','14:00',360,0,'#67C23A',0,22,1,'2025-11-06 15:10:54.339','2026-03-13 15:10:47.651',NULL,115),
('e2351a22-85db-4cc9-b3a2-dc27d5521007','default-org','急诊审核上','401','regular','','08:00','14:00',360,0,'#FB688D',0,1,1,'2025-12-31 10:46:58.969','2026-03-13 11:34:26.222',NULL,7),
('ebfab16f-6326-46d0-8009-ecbc77f72fa5','default-org','DR审核下','204','regular','DR审核报告-下午班次','13:30','17:30',240,0,'#409EFF',0,10,0,'2025-11-06 15:16:04.984','2025-11-21 14:39:03.915',NULL,112),
('f9ee2a80-678a-4453-b31d-e8ebe2d31ffb','default-org','本部夜班','305','regular','周一至周日','20:00','24:00',240,0,'#E6A23C',0,1,1,'2025-11-08 10:08:55.291','2026-03-13 17:23:01.581',NULL,3);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
